//--------------------------------------------------------------------------*
// 文件名: PWM.c                                                            *
// 说  明: 该头文件为PWM模块初始化及功能函数实现文件                        *
//         (1)PWMInit:PWM初始化                                             *
//         (2)PWMSetting:设置周期和占空比                                   *
//         (3)PWMEnable:使能PWM                                             *
//         (4)PWMDisEnable:禁止PWM                                          *
//--------------------------------------------------------------------------*
//头文件包含，及宏定义区

  //头文件包含 
#include "Allh.h"                             //总头文件

//构件函数实现

//PWMInit:初始化PWM系统配置-----------------------------------------------*
//功  能:设置通道的PWM                                                    *
//返  回:无                                                               *
//------------------------------------------------------------------------*
void PWMInit(void)  
{
   PWMDisEnable;
   //(2) 设置A,B的时钟频率  
   PWMPRCLK=0b00000111;
   //          ||| |||_  
   //          ||| ||__\时钟A频率为Fbus/2^7=125KHz
   //          ||| |___/
   //          |||_
   //          ||__\时钟B频率为Fbus/2^0
   //          |___/
   //(3) PWM时钟源选择,选择A时钟作为PWM通道5的时钟源
   PWMCLK&=~(1<<5);
   //(4) 设置对齐方式--中心对齐
   PWMCAE&=~(1<<5);
   //(5) 设置极性
   //PWMPOL|=1<<5;    //正极性(信号占空比=占空比寄存器/周期寄存器)
   PWMPOL&=~(1<<5);   //负极性(信号占空比=1-占空比寄存器/周期寄存器)
   PWMEnable;
   PWMSetting(156,0); 
}//
  


void PWM_Init(void)//
{
  //
  PWME = 0b00000000; //均禁止使能
         //||||||||
         //|||||||0
         //||||||1
         //|||||2
         //||||3
         //|||4
         //||5
         //|6
 //通道选择7
  //PWMPRCLK = 0b01110111; 
               //||||||||
               //|||||210:PCKA2-0时钟A频率   8/2^7=Fbus/128=62.5KHz
               //|||||
               //|||||
               //||||X
               //|654:PCKB2-0时钟B频率  8/2^7=62.5K
               //|
               //|
               //X
             
  PWMPRCLK = 0b01010101; 
             //||||||||
             //|||||210:PCKA2-0时钟A频率   8/2^7=Fbus/128=62.5KHz
             //|||||
             //|||||                     8/2^2=2MHz
             //||||X                    8/2^5 = 250k
             //|654:PCKB2-0时钟B频率  8/2^7=62.5K
             //|
             //|
             //X
  
  PWMSCLA = 0b01111101;//125   CLA=250k/125/2=1k
  PWMSCLB = 0b01111101;//125   CLA=250k/125/2=1k
  
  
  PWMCLK = 0b01101000;
           //||||||||
           //PWMCLK7-0= 选择A  B作为通道3、5、6的时钟
  
  PWMCAE = 0b01101000;
           //||||||||
           //76543210
           //对齐方式，中心对齐
  PWMPOL = 0b01101000;
           //||||||||     //正极性(信号占空比=占空比寄存器/周期寄存器)
           //76543210     //负极性(信号占空比=1-占空比寄存器/周期寄存器)
           //正负极性控制
  
  
  //当使用时使能该模块 否则不使能
  //PWME = 0b01101000; //通道选择3、5、6通道使能
         //||||||||
         //|||||||0
         //||||||1
         //|||||2
         //||||3
         //|||4
         //||5
         //|6
         //7 
 
 
  //进行初始化 
  /**
  PWMPER3=100;
  PWMDTY3=100;
  
  PWMPER5=0;
  PWMDTY5=0;
  
  PWMPER6=100;
  PWMDTY6=0;
  **/
 //BTS724_ChEnable_Config();                                         
}//

  
  

  
  
  
  
  
  
  

  //PWMSetting:PWM周期和占空比设置------------------------------------------*
  //功  能:根据参数设置f周期和占空比                                        *
  //参  数:period－PWM周期所占用的时钟周期个数                              *
  //       duty－PWM占空比所占用的时钟周期个数                              *
  //返  回:无                                                               *
  //------------------------------------------------------------------------*
  void PWMSetting(uint8 period, uint8 duty)
  {
              //设置占空比寄存器
              PWMDTY5 = (uint8)((uint16)period*duty/100);
              //设置周期寄存器
              PWMPER5 = (uint8)period;
  }
