#include "Allh.h"



             

//AD初始化

//AD1连接制动踏板


void AD_Init(void)
{
  //
  
  ATD0CTL1 = 0b00100000;
             //||||||||
             //||||ETRIGCH0~3 外部触发通道选择 9开始
             //||||
             //||||
             //||||
             //|||SMP_DIS
             //|SRES01 AD采样分辨率选择 00 8位  01 10位  10 12位  11保留
             //|
             //ETRIGSEL 外部触发源选择 0禁用 1触发通道
  
  ATD0CTL2 = 0b01000000;       
             //||||||||
             //|||||||ACMPIE ATD比较中断使能
             //||||||ASCIE ATD序列完成中断使能
             //|||||ETRIGE 外部触发模式
             //||||ETRIGP 外部触发极性
             //|||ETRIGLE 外部触发沿控制 
             //||ICLKSTP 外部时钟stop模式 
             //|AFFC ATD标识符快速清除 0 CCF置1清标志  1 切换ATD标志高频清除
             //XXX=0   
        
  ATD0CTL3 = 0b10000000;
             //||||||||
             //||||||FRZ0背景调试锁定使能
             //||||||
             //|||||FIFO 结果寄存器模式
             //|转换序列长度
             //|
             //|
             //| 
             //DJM 结果寄存器左右排列
           //0b01100011
  ATD0CTL4 = 0b01100011;
             //||||||||
             //|||PRS[4:0] 时钟分频
             //|||
             //|||
             //|||
             //|||
             //SMP0 采样时间选择
             //
             // 
      
  ATD0CTL5 = 0b00110000;
             //||||||||
             //|||||||CA
             //||||||CB
             //|||||CC
             //||||CD
             //|||MULT 多次采样模式
             //||SCAN
             //|SC
             //XXX=0        
}




